In [1]:
# 1. Zaimportuj moduł pandas i numpy nadaj im standardowe aliasy
#2. Do zmiennej suppliers zaimportuj zawartość pliku suppliers.csv. Pobierz tylko kolumny SupplierID,
#CompanyName, City
# 3. Do zmiennej products zaimportuj zawartość pliku products.csv". Pobierz tylko kolumny ProductID,
#ProductName, SupplierID**
# 4. W kolejnych zadaniach będziesz łączyć ze sobą suppliers i products, a do połączenia wykorzystasz kolumnę
# SupplierID. Kolumna ta może delikatnie zmienić nazwę lub stać się indeksem. W zależności od tego musisz w
# odpowiedni sposób zmieniać parametry i wybierać odpowiednie polecenia:
# 5. Do data frame suppliers dołącz dane z products (tak jak to opisano powyżej)
# 6. W suppliers zdefiniuj SupplierID jako indeks (pamiętaj o parametrze inplace). Następnie do data frame
# suppliers dołącz dane z products
# 7. W products zdefiniuj SupplierID jako indeks (pamiętaj o parametrze inplace). Następnie do data frame
# suppliers dołącz dane z products
# 8. W suppliers zresetuj indeks (pamiętaj o parametrze inplace). Następnie do data frame suppliers dołącz dane
# z products
# 9. W products zresetuj indeks (pamiętaj o parametrze inplace), a potem zmień nazwę kolumny SupplierID na
# supplier_id. Następnie do data frame suppliers dołącz dane z products

In [2]:
import pandas as pd 
import numpy as np

In [5]:
suppliers = pd.read_csv('/Users/arturdanyliv/Downloads/course-files/northwind-mongo-master/suppliers.csv',usecols = ['SupplierID','CompanyName', 'City'])

In [6]:
products = pd.read_csv('/Users/arturdanyliv/Downloads/course-files/northwind-mongo-master/products.csv',usecols=['ProductID','ProductName','SupplierID'])

In [7]:
suppliers.merge(products, on='SupplierID').head(3)

   SupplierID     CompanyName    City  ProductID    ProductName
0           1  Exotic Liquids  London          1           Chai
1           1  Exotic Liquids  London          2          Chang
2           1  Exotic Liquids  London          3  Aniseed Syrup

In [8]:
suppliers.set_index("SupplierID", inplace=True)

In [9]:
suppliers.merge(products, left_index=True, right_on="SupplierID").head(3)

      CompanyName    City  ProductID    ProductName  SupplierID
0  Exotic Liquids  London          1           Chai           1
1  Exotic Liquids  London          2          Chang           1
2  Exotic Liquids  London          3  Aniseed Syrup           1

In [10]:
products.set_index("SupplierID",inplace=True)

In [11]:
suppliers.join(products).head(3)

               CompanyName    City  ProductID    ProductName
SupplierID
1           Exotic Liquids  London          1           Chai
1           Exotic Liquids  London          2          Chang
1           Exotic Liquids  London          3  Aniseed Syrup

In [12]:
suppliers.reset_index(inplace=True)

In [13]:
suppliers.merge(products, left_on="SupplierID", right_index=True).head(3)

   SupplierID     CompanyName    City  ProductID    ProductName
0           1  Exotic Liquids  London          1           Chai
0           1  Exotic Liquids  London          2          Chang
0           1  Exotic Liquids  London          3  Aniseed Syrup

In [14]:
products.reset_index(inplace=True)

In [15]:
products.rename({'SupplierID':'supplier_id'}, axis=1, inplace=True)

In [16]:
suppliers.merge(products, left_on="SupplierID", right_on="supplier_id").head(3)

   SupplierID     CompanyName    City  supplier_id  ProductID    ProductName
0           1  Exotic Liquids  London            1          1           Chai
1           1  Exotic Liquids  London            1          2          Chang
2           1  Exotic Liquids  London            1          3  Aniseed Syrup